Repository: shreyes-patil/flashgen
Catalog: FlashGen/Resources/*.lproj/Localizable.strings
Languages: hi, kn

# tab_home
source: Home
hi: होम
kn: ಮುಖಪುಟ

# tab_generate
source: Generate
hi: बनाएं
kn: ರಚಿಸಿ

# tab_settings
source: Settings
hi: सेटिंग्स
kn: ಸೆಟ್ಟಿಂಗ್‌ಗಳು

source: Last reviewed %@
hi: पिछली समीक्षा %@
kn: ಕೊನೆಯದಾಗಿ ನೋಡಿದ್ದು %@

source: %d flashcards
hi: %d फ्लैशकार्ड
kn: %d ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳು

# saved_flashcard_sets_title
source: My Sets
hi: मेरे सेट
kn: ನನ್ನ ಸೆಟ್‌ಗಳು

# loading_sets_progress_title
source: Loading Flashcard Sets
hi: फ्लैशकार्ड सेट लोड हो रहे हैं
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್‌ಗಳನ್ನು ಲೋಡ್ ಮಾಡಲಾಗುತ್ತಿದೆ

# delete_set_button
source: Delete
hi: हटाएं
kn: ಅಳಿಸಿ

# delete_set_accessibility_label
source: Delete flashcard set
hi: फ्लैशकार्ड सेट हटाएं
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್ ಅಳಿಸಿ

# delete_set_accessibility_hint
source: Permanently removes this flashcard set
hi: इस सेट को स्थायी रूप से हटा देता है
kn: ಈ ಸೆಟ್ ಅನ್ನು ಶಾಶ್ವತವಾಗಿ ತೆಗೆದುಹಾಕುತ್ತದೆ

# delete_set_alert_title
source: Delete Set?
hi: सेट हटाएं?
kn: ಸೆಟ್ ಅಳಿಸಬೇಕೆ?

# delete_set_alert_message
source: This will permanently delete this flashcard set and all its cards. This action cannot be undone.
hi: यह इस फ्लैशकार्ड सेट और इसके सभी कार्डों को स्थायी रूप से हटा देगा। यह क्रिया पूर्ववत नहीं की जा सकती।
kn: ಇದು ಈ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್ ಮತ್ತು ಅದರ ಎಲ್ಲಾ ಕಾರ್ಡ್‌ಗಳನ್ನು ಶಾಶ್ವತವಾಗಿ ಅಳಿಸುತ್ತದೆ. ಈ ಕ್ರಿಯೆಯನ್ನು ರದ್ದುಗೊಳಿಸಲು ಸಾಧ್ಯವಿಲ್ಲ.

source: Delete
hi: हटाएं
kn: ಅಳಿಸಿ

source: Cancel
hi: रद्द करें
kn: ರದ್ದುಮಾಡಿ

# empty_sets_title
source: No Flashcard Sets
hi: कोई फ्लैशकार्ड सेट नहीं
kn: ಯಾವುದೇ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್‌ಗಳಿಲ್ಲ

# empty_sets_subtitle
source: Tap the Generate tab to create your first set!
hi: अपना पहला सेट बनाने के लिए 'बनाएं' टैब पर टैप करें!
kn: ನಿಮ್ಮ ಮೊದಲ ಸೆಟ್ ರಚಿಸಲು 'ರಚಿಸಿ' ಟ್ಯಾಬ್ ಟ್ಯಾಪ್ ಮಾಡಿ!

# empty_sets_accessibility_hint
source: You haven't created any flashcard sets yet.
hi: आपने अभी तक कोई फ्लैशकार्ड सेट नहीं बनाया है।
kn: ನೀವು ಇನ್ನೂ ಯಾವುದೇ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್‌ಗಳನ್ನು ರಚಿಸಿಲ್ಲ.

# retry_button_title
source: Retry
hi: पुनः प्रयास करें
kn: ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ

# retry_button_accessibility_label
source: Retry loading sets
hi: लोड करने का पुनः प्रयास करें
kn: ಲೋಡ್ ಮಾಡಲು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ

# retry_button_accessibility_hint
source: Attempts to reload your flashcard sets from the server
hi: सर्वर से आपके फ्लैशकार्ड सेट को फिर से लोड करने का प्रयास करता है
kn: ಸರ್ವರ್‌ನಿಂದ ನಿಮ್ಮ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್‌ಗಳನ್ನು ಮರುಲೋಡ್ ಮಾಡಲು ಪ್ರಯತ್ನಿಸುತ್ತದೆ

# loading_sets_accessibility_label
source: Loading your flashcard sets
hi: आपके फ्लैशकार्ड सेट लोड हो रहे हैं
kn: ನಿಮ್ಮ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್‌ಗಳನ್ನು ಲೋಡ್ ಮಾಡಲಾಗುತ್ತಿದೆ

# saved_flashcard_sets_list_accessibility_label
source: List of your saved flashcard sets
hi: आपके सहेजे गए फ्लैशकार्ड सेट की सूची
kn: ನಿಮ್ಮ ಉಳಿಸಿದ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್ ಸೆಟ್‌ಗಳ ಪಟ್ಟಿ

source: Sort By
hi: क्रमबद्ध करें
kn: ವಿಂಗಡಿಸಿ

# sort_date_created
source: Date Created
hi: बनाने की तिथि
kn: ರಚಿಸಿದ ದಿನಾಂಕ

# sort_last_reviewed
source: Last Reviewed
hi: पिछली समीक्षा
kn: ಕೊನೆಯದಾಗಿ ನೋಡಿದ್ದು

# sort_alphabetical
source: Alphabetical
hi: वर्णानुक्रम
kn: ಅಕ್ಷರಮಾಲೆ

source: Never
hi: कभी नहीं
kn: ಎಂದಿಗೂ ಇಲ್ಲ

# question_label
source: Question
hi: प्रश्न
kn: ಪ್ರಶ್ನೆ

source: Save
hi: सहेजें
kn: ಉಳಿಸಿ

source: Just now
hi: अभी
kn: ಈಗಷ್ಟೇ

source: Start Practicing
hi: अभ्यास शुरू करें
kn: ಅಭ್ಯಾಸ ಪ್ರಾರಂಭಿಸಿ

# start_practicing_accessibility_label
source: Start practicing
hi: अभ्यास शुरू करें
kn: ಅಭ್ಯಾಸ ಪ್ರಾರಂಭಿಸಿ

# start_practicing_accessibility_hint
source: Begin going through the flashcards in this set
hi: इस सेट के फ्लैशकार्ड के माध्यम से जाना शुरू करें
kn: ಈ ಸೆಟ್‌ನ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳನ್ನು ಓದಲು ಪ್ರಾರಂಭಿಸಿ

# flashcard_set_title
source: %@ Flashcards
hi: %@ फ्लैशकार्ड
kn: %@ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳು

# generate.title
source: Generate
hi: सेट बनाएं
kn: ಸೆಟ್ ರಚಿಸಿ

# generate.topic.placeholder
source: Enter a topic
hi: एक विषय दर्ज करें
kn: ಒಂದು ವಿಷಯವನ್ನು ನಮೂದಿಸಿ

# generate.topic.label
source: Topic
hi: विषय
kn: ವಿಷಯ

# generate.difficulty.label
source: Difficulty
hi: कठिनाई
kn: ಕಠಿಣತೆ

# generate.count.label
source: Number of Flashcards
hi: फ्लैशकार्ड की संख्या
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳ ಸಂಖ್ಯೆ

# generate.count.value
source: %d Flashcards
hi: %d फ्लैशकार्ड
kn: %d ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳು

# flashcard_singular
source: Flashcard
hi: फ्लैशकार्ड
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್

# flashcards_plural
source: Flashcards
hi: फ्लैशकार्ड
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳು

# generate.button
source: Generate Flashcards
hi: फ्लैशकार्ड उत्पन्न करें
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳನ್ನು ರಚಿಸಿ

# generate.button.hint
source: Starts generating flashcards based on your inputs
hi: फ्लैशकार्ड उत्पन्न करने के लिए दो बार टैप करें
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳನ್ನು ರಚಿಸಲು ಎರಡು ಬಾರಿ ಟ್ಯಾಪ್ ಮಾಡಿ

# generate.preview.title
source: Preview
hi: पूर्वावलोकन
kn: ಮುನ್ನೋಟ

# generate.preview.no_topic
source: No topic selected
hi: कोई विषय नहीं चुना गया
kn: ಯಾವುದೇ ವಿಷಯ ಆಯ್ಕೆ ಮಾಡಿಲ್ಲ

# difficulty_easy
source: Easy
hi: आसान
kn: ಸುಲಭ

# difficulty_medium
source: Medium
hi: मध्यम
kn: ಮಧ್ಯಮ

# difficulty_hard
source: Hard
hi: कठिन
kn: ಕಠಿಣ

# error.empty_topic
source: Please enter a topic.
hi: कृपया एक विषय दर्ज करें।
kn: ದಯವಿಟ್ಟು ವಿಷಯವನ್ನು ನಮೂದಿಸಿ.

# error.network
source: Network error occurred. Try again.
hi: नेटवर्क त्रुटि हुई। पुनः प्रयास करें।
kn: ನೆಟ್‌ವರ್ಕ್ ದೋಷ ಸಂಭವಿಸಿದೆ. ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ.

# error.decoding
source: Failed to decode flashcards.
hi: फ्लैशकार्ड डिकोड करने में विफल।
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳನ್ನು ಡಿಕೋಡ್ ಮಾಡಲು ವಿಫಲವಾಗಿದೆ.

# error.unknown
source: An unknown error occurred.
hi: एक अज्ञात त्रुटि हुई।
kn: ಅಜ್ಞಾತ ದೋಷ ಸಂಭವಿಸಿದೆ.

# flashcards.title
source: Flashcards
hi: फ्लैशकार्ड
kn: ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳು

# flashcards.empty
source: No flashcards available
hi: कोई फ्लैशकार्ड उपलब्ध नहीं
kn: ಯಾವುದೇ ಫ್ಲ್ಯಾಶ್‌ಕಾರ್ಡ್‌ಗಳು ಲಭ್ಯವಿಲ್ಲ

# flashcards.prev
source: Previous
hi: पिछला
kn: ಹಿಂದಿನ

# flashcards.next
source: Next
hi: अगला
kn: ಮುಂದಿನ

# flashcards.reveal
source: Reveal
hi: दिखाएं
kn: ತೋರಿಸಿ

# flashcards.hide
source: Hide
hi: छिपाएं
kn: ಮರೆಮಾಡಿ

# flashcard.question
source: Question
hi: प्रश्न
kn: ಪ್ರಶ್ನೆ

# flashcard.answer
source: Answer
hi: उत्तर
kn: ಉತ್ತರ
